{
  "contentApi" : {
    "id" : "world/2012/dec/14/obama-meaningful-action-newtown-shooting",
    "sectionId" : "world",
    "sectionName" : "World news",
    "webPublicationDate" : 1355524740000,
    "webTitle" : "Obama promises 'meaningful action' after Newtown school shooting",
    "webUrl" : "http://www.guardian.co.uk/world/2012/dec/14/obama-meaningful-action-newtown-shooting",
    "apiUrl" : "http://content.guardianapis.com/world/2012/dec/14/obama-meaningful-action-newtown-shooting",
    "fields" : {
      "newspaperPageNumber" : "4",
      "trailText" : "<p>Michael Bloomberg and other gun control advocates renew calls for reform amid overwhelming opposition to gun restrictions</p>",
      "headline" : "Obama promises 'meaningful action' after Newtown school shooting",
      "body" : "<p>Barack Obama wiped away tears at the White House as he expressed grief over the children killed in the Connecticut massacre and promised &quot;meaningful action&quot; to prevent similar shooting rampages in the future.</p><p>Obama has promised to act on gun control after earlier shooting incidents but subsequently done nothing implement any changes. Over the last four years of his presidency, restrictions on guns – in particular concealed weapons – have become more relaxed and gun sales soared.</p><p>There have been five major shooting sprees since he has been president, three of them this year. This one is different because the majority of the victims in the school in Newtown are young children, but the most recent opinion polls have shown overwhelming opposition to gun restrictions.</p><p>Obama, speaking in the White House press room, said the loss of innocent lives had broken hearts. &quot;As a country, we have been through this too many times. Whether it's an elementary school in Newtown, or a shopping mall in Oregon, or a temple in Wisconsin, or a movie theater in Aurora, or a street corner in Chicago – these neighborhoods are our neighborhoods, and these children are our children. </p><p>&quot;And we're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.&quot;<br />Just minutes earlier, he broke down while delivering the statement. He said: &quot;The majority of those who died today were children – beautiful little kids between the ages of 5 and 10 years old.&quot; Choking up, tears welling in his eyes, he paused for what seemed like an interminable time, though it was only 10 seconds. </p><p>He went on: &quot;They had their entire lives ahead of them – birthdays, graduations, weddings, kids of their own.&quot; He then had to pause again.</p><p>Such emotion from the president is unusual, at odds with Obama's reputation for being overly cool. Twice during the statement, he wiped away tears as they began to form. The only other time he has been seen to cry in public was last month, when he spoke to campaign workers at the end of the White House election.</p><p>As a mark of respect for the dead, he ordered flags across the country to be flown at half-staff.</p><p>Minutes after Obama spoke there was strong response from the most high-profile figure in the country advocating gun control, New York mayor Michael Bloomberg, who called for an end to what he described as this madness.</p><p>&quot;President Obama rightly sent his heartfelt condolences to the families in Newtown. But the country needs him to send a bill to Congress to fix this problem. Calling for 'meaningful action' is not enough. We need immediate action,&quot; Bloomberg said.</p><p>&quot;We have heard all the rhetoric before. What we have not seen is leadership – not from the White House and not from Congress. That must end today.&quot;</p><p>New York governor Andrew Cuomo took a different view. In a statement paying tribute to the victims of &quot;this senseless and horrific act of violence&quot;, Cuomo said: &quot;While we don't have all the facts and our focus must be on the victims, this is yet another senseless and horrific act of violence involving guns. We as a society must unify and once and for all crack down on the guns that have cost the lives of far too many innocent Americans. Let this terrible tragedy finally be the wake-up call for aggressive action and I pledge my full support in that effort.&quot;</p><p>Early in his political career, Obama championed modest gun controls, but since his run for president he has largely avoided the issue.</p><p>Earlier on Friday, Obama's spokesman Jay Carney provoked a backlash from gun control activists when he said that the day of the Connecticut school shooting was not an appropriate one for a discussion about gun laws. </p><p>Carney, asked at the daily press conference whether the shooting would raise gun control up the president's agenda, said there would be a day for discussion on the policy issue. &quot;But I don't think today is that day,&quot; he said.</p><p>Gun control advocates flooded websites and Twitter, complaining that if this was not a day for discussion, when would be a better time.</p><p>Bloomberg, who is co-chair of Mayors Against Illegal Guns, rounded on Carney. &quot;We heard after Columbine that it was too soon to talk about gun laws. We heard it after Virginia Tech. After Tucson and Aurora and Oak Creek. And now we are hearing it again. For every day we wait, 34 more people are murdered with guns. Today, many of them were five-year-olds,&quot; Bloomberg said. </p><p>His co-chair in the Mayors Against Illegal Guns, Boston mayor Thomas Menino, echoed him. &quot;Now is the time for a national policy on guns that takes the loopholes out of the laws, the automatic weapons out of our neighborhoods and the tragedies like today out of our future,&quot; Menino said. </p><p>Dan Gross, president of the Brady Campaign to Prevent Gun Violence, joined in the calls for action. &quot;Another day, another horrific shooting eating away at our collective peace of mind. This time at a school in Connecticut. We are better than this this. What matters is not what we do after the sensational tragedies. It's what we do between them – to make the voice of the American public heard,&quot; Gross said.</p><p>The National Rifle Association, which would almost certainly seek to block any legislation that would introduce significant gun restrictions, was lying low on Friday, as it normally does after shooting sprees. </p><p>An NRA public affairs spokeswoman, in response to a question about the Connecticut shooting, said: &quot;Until the facts are thoroughly known, the NRA will not be making any comment.</p><p>In spite of Bloomberg's call for congressional action, the Republican House speaker, John Boehner, avoided any mention of action in his statement, confining himself to an expression of sympathy. </p><p>&quot;The horror of this day seems so unbearable, but we will lock arms and unite as citizens, for that is how Americans rise above unspeakable evil,&quot; Boehner said.</p><p>There was a public outcry after the Columbine school shooting spree in 1999 and the Virginia Tech massacre in 2007, the worst single incident in recent US history, claiming 33 lives. Calls for gun control were renewed last year when congresswoman Gabby Giffords was shot in Arizona, and again this year, though to a much lesser extent, when 12 were killed in Aurora, Colorado.</p><p>Obama, two months after the Giffords shooting, promised &quot;sound and effective steps that will actually keep those irresponsible, law-breaking few from getting their hands on a gun in the first place&quot;. The only measure to surface was more intensive background check but even this modest measure has so far failed to emerge from the Justice Department.</p><p>On Friday, Giffords' husband, former astronaut Mark Kelly, called for immediate action. In a statement, he said: &quot;As we mourn, we must sound a call for our leaders to stand up and do what is right. This time our response must consist of more than regret, sorrow, and condolence. The children of Sandy Hook elementary school and all victims of gun violence deserve leaders who have the courage to participate in a meaningful discussion about our gun laws – and how they can be reformed and better enforced to prevent gun violence and death in America. This can no longer wait.&quot;</p><p>Debate about gun laws was largely absent from this year's White House race, with Obama unwilling to provoke the gun lobby. The Republican presidential candidate Mitt Romney said he saw no need to change any of the laws, even to restore a limited restrictions on automatic assault rifles. Obama agreed.</p><p>Both Romney and Obama had in the past supported limited gun controls but both dropped this in the face of polls showing widespread support for the right to carry guns. </p><p>A Gallup poll last year, only months after the Giffords shooting, found a record low in support for gun controls, just 26%. When Gallup first asked the question in 1959, there was 60% support. </p><p>During the campaign, when Carney was asked about Obama's position, he said the main focus of president, who four years earlier had supported a ban on assault-weapons, was to protect the second amendment, the constitutional protection for gun ownership. </p><p>Bills introduced into Congress in recent years to restrict guns have gone nowhere. In fact, laws around the country have been more lax, allowing people to carry concealed weapons and giving them more freedom about places they can take them into, including legislatures. In Florida, one million people have permits allowing them to carry concealed weapons.</p><p>Four Republican-dominated legislatures – Pennsylvania, South Carolina, Alabama and Tennessee – are considering allowing employees to take guns to work.</p><p>Bloomberg News reported this month that gun manufacturers Smith &amp; Wesson recorded record sales for its most recent quarter, up 48% from a year earlier.</p><!-- Guardian Watermark: internal-code/content/401106041|2012-12-22T11:49:05Z|cb9e043d4026f23b9843ae5496a124c765f95b2e -->",
      "showInRelatedContent" : "true",
      "lastModified" : "2012-12-15T06:51:49Z",
      "hasStoryPackage" : "true",
      "score" : "1.0",
      "secureThumbnail" : "https://static-secure.guim.co.uk/sys-images/Guardian/Pix/pictures/2012/12/14/1355523402779/obama-gun-control-003.jpg",
      "standfirst" : "Michael Bloomberg and other gun control advocates renew calls for reform amid overwhelming opposition to gun restrictions",
      "shortUrl" : "http://gu.com/p/3ch4d",
      "thumbnail" : "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2012/12/14/1355523402779/obama-gun-control-003.jpg",
      "commentable" : "false",
      "internalContentCode" : "401106041",
      "isPremoderated" : "false",
      "byline" : "Ewen MacAskill in Washington",
      "publication" : "The Guardian",
      "newspaperEditionDate" : "2012-12-15",
      "internalPageCode" : "1843033",
      "shouldHideAdverts" : "true",
      "liveBloggingNow" : "false",
      "commentCloseDate" : "2012-12-17T22:39:17Z"
    },
    "tags" : [
      {
        "id" : "world/newtown-shooting",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Newtown shooting",
        "webUrl" : "http://www.guardian.co.uk/world/newtown-shooting",
        "apiUrl" : "http://content.guardianapis.com/world/newtown-shooting",
        "references" : [
          
        ]
      },
      {
        "id" : "world/gun-control",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "US gun control",
        "webUrl" : "http://www.guardian.co.uk/world/gun-control",
        "apiUrl" : "http://content.guardianapis.com/world/gun-control",
        "references" : [
          
        ]
      },
      {
        "id" : "world/gun-crime",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Gun crime",
        "webUrl" : "http://www.guardian.co.uk/world/gun-crime",
        "apiUrl" : "http://content.guardianapis.com/world/gun-crime",
        "references" : [
          
        ]
      },
      {
        "id" : "world/usa",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "United States",
        "webUrl" : "http://www.guardian.co.uk/world/usa",
        "apiUrl" : "http://content.guardianapis.com/world/usa",
        "references" : [
          
        ]
      },
      {
        "id" : "world/connecticut",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Connecticut",
        "webUrl" : "http://www.guardian.co.uk/world/connecticut",
        "apiUrl" : "http://content.guardianapis.com/world/connecticut",
        "references" : [
          
        ]
      },
      {
        "id" : "world/world",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "World news",
        "webUrl" : "http://www.guardian.co.uk/world/world",
        "apiUrl" : "http://content.guardianapis.com/world/world",
        "references" : [
          
        ]
      },
      {
        "id" : "tone/news",
        "type" : "tone",
        "webTitle" : "News",
        "webUrl" : "http://www.guardian.co.uk/tone/news",
        "apiUrl" : "http://content.guardianapis.com/tone/news",
        "references" : [
          
        ]
      },
      {
        "id" : "world/us-crime",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "US crime",
        "webUrl" : "http://www.guardian.co.uk/world/us-crime",
        "apiUrl" : "http://content.guardianapis.com/world/us-crime",
        "references" : [
          
        ]
      },
      {
        "id" : "world/michaelbloomberg",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Michael Bloomberg",
        "webUrl" : "http://www.guardian.co.uk/world/michaelbloomberg",
        "apiUrl" : "http://content.guardianapis.com/world/michaelbloomberg",
        "references" : [
          
        ]
      },
      {
        "id" : "world/republicans",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Republicans",
        "webUrl" : "http://www.guardian.co.uk/world/republicans",
        "apiUrl" : "http://content.guardianapis.com/world/republicans",
        "references" : [
          
        ]
      },
      {
        "id" : "world/democrats",
        "type" : "keyword",
        "sectionId" : "world",
        "sectionName" : "World news",
        "webTitle" : "Democrats",
        "webUrl" : "http://www.guardian.co.uk/world/democrats",
        "apiUrl" : "http://content.guardianapis.com/world/democrats",
        "references" : [
          
        ]
      },
      {
        "id" : "profile/ewenmacaskill",
        "type" : "contributor",
        "webTitle" : "Ewen MacAskill",
        "webUrl" : "http://www.guardian.co.uk/profile/ewenmacaskill",
        "apiUrl" : "http://content.guardianapis.com/profile/ewenmacaskill",
        "references" : [
          
        ],
        "bio" : "<p>Ewen MacAskill is the Guardian's Washington DC bureau chief. He was diplomatic editor from 1999-2006, chief political correspondent from 1996-99 and political editor of the Scotsman from 1990-96</p>",
        "bylineImageUrl" : "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2008/01/21/ewen_macaskill_140x140.jpg"
      },
      {
        "id" : "theguardian/mainsection/topstories",
        "type" : "newspaper-book-section",
        "sectionId" : "theguardian",
        "sectionName" : "From the Guardian",
        "webTitle" : "Top stories",
        "webUrl" : "http://www.guardian.co.uk/theguardian/mainsection/topstories",
        "apiUrl" : "http://content.guardianapis.com/theguardian/mainsection/topstories",
        "references" : [
          
        ]
      },
      {
        "id" : "theguardian/mainsection",
        "type" : "newspaper-book",
        "sectionId" : "news",
        "sectionName" : "News",
        "webTitle" : "Main section",
        "webUrl" : "http://www.guardian.co.uk/theguardian/mainsection",
        "apiUrl" : "http://content.guardianapis.com/theguardian/mainsection",
        "references" : [
          
        ]
      },
      {
        "id" : "type/article",
        "type" : "type",
        "webTitle" : "Article",
        "webUrl" : "http://www.guardian.co.uk/articles",
        "apiUrl" : "http://content.guardianapis.com/articles",
        "references" : [
          
        ]
      },
      {
        "id" : "publication/theguardian",
        "type" : "publication",
        "sectionId" : "theguardian",
        "sectionName" : "From the Guardian",
        "webTitle" : "The Guardian",
        "webUrl" : "http://www.guardian.co.uk/theguardian/all",
        "apiUrl" : "http://content.guardianapis.com/theguardian/all",
        "references" : [
          
        ]
      }
    ],
    "factboxes" : [
      
    ],
    "mediaAssets" : [
      
    ],
    "references" : [
      
    ]
  },
  "entities" : [
    {
      "text" : "Americans",
      "frequency" : 2,
      "entity" : "Misc"
    },
    {
      "text" : "Gallup",
      "frequency" : 2,
      "entity" : "Misc"
    },
    {
      "text" : "Menino",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Giffords",
      "frequency" : 3,
      "entity" : "Location"
    },
    {
      "text" : "Michael Bloomberg",
      "frequency" : 3,
      "entity" : "Person"
    },
    {
      "text" : "Cuomo",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Florida",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Virginia Tech",
      "frequency" : 2,
      "entity" : "Location"
    },
    {
      "text" : "White House",
      "frequency" : 5,
      "entity" : "Location"
    },
    {
      "text" : "Pennsylvania",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Sandy Hook",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Washington",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "NRA",
      "frequency" : 2,
      "entity" : "Organisation"
    },
    {
      "text" : "South Carolina",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Mayors Against Illegal Guns",
      "frequency" : 2,
      "entity" : "Organisation"
    },
    {
      "text" : "Smith & Wesson",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Ewen MacAskill",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Carney",
      "frequency" : 3,
      "entity" : "Person"
    },
    {
      "text" : "Brady Campaign to Prevent Gun Violence",
      "frequency" : 1,
      "entity" : "Misc"
    },
    {
      "text" : "National Rifle Association",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Justice Department",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Romney",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Gabby Giffords",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "US",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Bloomberg News",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Oregon",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Tucson",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Congress",
      "frequency" : 3,
      "entity" : "Organisation"
    },
    {
      "text" : "Barack Obama",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Dan Gross",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Mitt Romney",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Newtown",
      "frequency" : 4,
      "entity" : "Location"
    },
    {
      "text" : "Republican House",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Thomas Menino",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Andrew Cuomo",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Arizona",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Mark Kelly",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Republican-dominated",
      "frequency" : 1,
      "entity" : "Misc"
    },
    {
      "text" : "Republican",
      "frequency" : 1,
      "entity" : "Misc"
    },
    {
      "text" : "American",
      "frequency" : 1,
      "entity" : "Misc"
    },
    {
      "text" : "Wisconsin",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Boehner",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Oak Creek",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Colorado",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "New York",
      "frequency" : 2,
      "entity" : "Location"
    },
    {
      "text" : "Aurora",
      "frequency" : 3,
      "entity" : "Location"
    },
    {
      "text" : "Jay Carney",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Chicago",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "John Boehner",
      "frequency" : 1,
      "entity" : "Person"
    },
    {
      "text" : "Guardian",
      "frequency" : 1,
      "entity" : "Organisation"
    },
    {
      "text" : "Tennessee",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Alabama",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Connecticut",
      "frequency" : 4,
      "entity" : "Location"
    },
    {
      "text" : "Boston",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "America",
      "frequency" : 1,
      "entity" : "Location"
    },
    {
      "text" : "Obama",
      "frequency" : 13,
      "entity" : "Person"
    },
    {
      "text" : "Bloomberg",
      "frequency" : 4,
      "entity" : "Organisation"
    },
    {
      "text" : "Columbine",
      "frequency" : 2,
      "entity" : "Organisation"
    },
    {
      "text" : "Twitter",
      "frequency" : 1,
      "entity" : "Misc"
    }
  ],
  "sentances" : [
    "Michael Bloomberg and other gun control advocates renew calls for reform amid overwhelming opposition to gun restrictions",
    "Barack Obama wiped away tears at the White House as he expressed grief over the children killed in the Connecticut massacre and promised \"meaningful action\" to prevent similar shooting rampages in the future.",
    "Obama has promised to act on gun control after earlier shooting incidents but subsequently done nothing implement any changes. Over the last four years of his presidency, restrictions on guns – in particular concealed weapons – have become more relaxed and gun sales soared.",
    "There have been five major shooting sprees since he has been president, three of them this year. This one is different because the majority of the victims in the school in Newtown are young children, but the most recent opinion polls have shown overwhelming opposition to gun restrictions.",
    "Obama, speaking in the White House press room, said the loss of innocent lives had broken hearts. \"As a country, we have been through this too many times. Whether it's an elementary school in Newtown, or a shopping mall in Oregon, or a temple in Wisconsin, or a movie theater in Aurora, or a street corner in Chicago – these neighborhoods are our neighborhoods, and these children are our children.",
    "\"And we're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.\" Just minutes earlier, he broke down while delivering the statement. He said: \"The majority of those who died today were children – beautiful little kids between the ages of 5 and 10 years old.\" Choking up, tears welling in his eyes, he paused for what seemed like an interminable time, though it was only 10 seconds.",
    "He went on: \"They had their entire lives ahead of them – birthdays, graduations, weddings, kids of their own.\" He then had to pause again.",
    "Such emotion from the president is unusual, at odds with Obama's reputation for being overly cool. Twice during the statement, he wiped away tears as they began to form. The only other time he has been seen to cry in public was last month, when he spoke to campaign workers at the end of the White House election.",
    "As a mark of respect for the dead, he ordered flags across the country to be flown at half-staff.",
    "Minutes after Obama spoke there was strong response from the most high-profile figure in the country advocating gun control, New York mayor Michael Bloomberg, who called for an end to what he described as this madness.",
    "\"President Obama rightly sent his heartfelt condolences to the families in Newtown. But the country needs him to send a bill to Congress to fix this problem. Calling for 'meaningful action' is not enough. We need immediate action,\" Bloomberg said.",
    "\"We have heard all the rhetoric before. What we have not seen is leadership – not from the White House and not from Congress. That must end today.\"",
    "New York governor Andrew Cuomo took a different view. In a statement paying tribute to the victims of \"this senseless and horrific act of violence\", Cuomo said: \"While we don't have all the facts and our focus must be on the victims, this is yet another senseless and horrific act of violence involving guns. We as a society must unify and once and for all crack down on the guns that have cost the lives of far too many innocent Americans. Let this terrible tragedy finally be the wake-up call for aggressive action and I pledge my full support in that effort.\"",
    "Early in his political career, Obama championed modest gun controls, but since his run for president he has largely avoided the issue.",
    "Earlier on Friday, Obama's spokesman Jay Carney provoked a backlash from gun control activists when he said that the day of the Connecticut school shooting was not an appropriate one for a discussion about gun laws.",
    "Carney, asked at the daily press conference whether the shooting would raise gun control up the president's agenda, said there would be a day for discussion on the policy issue. \"But I don't think today is that day,\" he said.",
    "Gun control advocates flooded websites and Twitter, complaining that if this was not a day for discussion, when would be a better time.",
    "Bloomberg, who is co-chair of Mayors Against Illegal Guns, rounded on Carney. \"We heard after Columbine that it was too soon to talk about gun laws. We heard it after Virginia Tech. After Tucson and Aurora and Oak Creek. And now we are hearing it again. For every day we wait, 34 more people are murdered with guns. Today, many of them were five-year-olds,\" Bloomberg said.",
    "His co-chair in the Mayors Against Illegal Guns, Boston mayor Thomas Menino, echoed him. \"Now is the time for a national policy on guns that takes the loopholes out of the laws, the automatic weapons out of our neighborhoods and the tragedies like today out of our future,\" Menino said.",
    "Dan Gross, president of the Brady Campaign to Prevent Gun Violence, joined in the calls for action. \"Another day, another horrific shooting eating away at our collective peace of mind. This time at a school in Connecticut. We are better than this this. What matters is not what we do after the sensational tragedies. It's what we do between them – to make the voice of the American public heard,\" Gross said.",
    "The National Rifle Association, which would almost certainly seek to block any legislation that would introduce significant gun restrictions, was lying low on Friday, as it normally does after shooting sprees.",
    "An NRA public affairs spokeswoman, in response to a question about the Connecticut shooting, said: \"Until the facts are thoroughly known, the NRA will not be making any comment.",
    "In spite of Bloomberg's call for congressional action, the Republican House speaker, John Boehner, avoided any mention of action in his statement, confining himself to an expression of sympathy.",
    "\"The horror of this day seems so unbearable, but we will lock arms and unite as citizens, for that is how Americans rise above unspeakable evil,\" Boehner said.",
    "There was a public outcry after the Columbine school shooting spree in 1999 and the Virginia Tech massacre in 2007, the worst single incident in recent US history, claiming 33 lives. Calls for gun control were renewed last year when congresswoman Gabby Giffords was shot in Arizona, and again this year, though to a much lesser extent, when 12 were killed in Aurora, Colorado.",
    "Obama, two months after the Giffords shooting, promised \"sound and effective steps that will actually keep those irresponsible, law-breaking few from getting their hands on a gun in the first place\". The only measure to surface was more intensive background check but even this modest measure has so far failed to emerge from the Justice Department.",
    "On Friday, Giffords' husband, former astronaut Mark Kelly, called for immediate action. In a statement, he said: \"As we mourn, we must sound a call for our leaders to stand up and do what is right. This time our response must consist of more than regret, sorrow, and condolence. The children of Sandy Hook elementary school and all victims of gun violence deserve leaders who have the courage to participate in a meaningful discussion about our gun laws – and how they can be reformed and better enforced to prevent gun violence and death in America. This can no longer wait.\"",
    "Debate about gun laws was largely absent from this year's White House race, with Obama unwilling to provoke the gun lobby. The Republican presidential candidate Mitt Romney said he saw no need to change any of the laws, even to restore a limited restrictions on automatic assault rifles. Obama agreed.",
    "Both Romney and Obama had in the past supported limited gun controls but both dropped this in the face of polls showing widespread support for the right to carry guns.",
    "A Gallup poll last year, only months after the Giffords shooting, found a record low in support for gun controls, just 26%. When Gallup first asked the question in 1959, there was 60% support.",
    "During the campaign, when Carney was asked about Obama's position, he said the main focus of president, who four years earlier had supported a ban on assault-weapons, was to protect the second amendment, the constitutional protection for gun ownership.",
    "Bills introduced into Congress in recent years to restrict guns have gone nowhere. In fact, laws around the country have been more lax, allowing people to carry concealed weapons and giving them more freedom about places they can take them into, including legislatures. In Florida, one million people have permits allowing them to carry concealed weapons.",
    "Four Republican-dominated legislatures – Pennsylvania, South Carolina, Alabama and Tennessee – are considering allowing employees to take guns to work.",
    "Bloomberg News reported this month that gun manufacturers Smith & Wesson recorded record sales for its most recent quarter, up 48% from a year earlier."
  ]
}